{
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Controllore e Isolata",
    "1": "Dominante e Schiavo emotivo",
    "2": "Geloso-Ossessivo e Sottomessa",
    "3": "Manipolatore e Dipendente emotiva",
    "4": "Narcisista e Succube",
    "5": "Perfezionista Critico e Insicura Cronica",
    "6": "Persona violenta e Succube",
    "7": "Psicopatico e Adulatrice",
    "8": "Sadico-Crudele e Masochista",
    "9": "Vittimista e Croccerossina"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Controllore e Isolata": 0,
    "Dominante e Schiavo emotivo": 1,
    "Geloso-Ossessivo e Sottomessa": 2,
    "Manipolatore e Dipendente emotiva": 3,
    "Narcisista e Succube": 4,
    "Perfezionista Critico e Insicura Cronica": 5,
    "Persona violenta e Succube": 6,
    "Psicopatico e Adulatrice": 7,
    "Sadico-Crudele e Masochista": 8,
    "Vittimista e Croccerossina": 9
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.55.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250004
}
